/* 

3) третя чверть: 3/4
4) четверта четверть: 4/4
5) Суму парних рядків
6) Суму непарних стовпців
7) У парних рядках – непарні стовпці, у непарних – парні.

Задача 2. Дано інформацію про прибуток К магазинів протягом тижня. Знайти :
1) загальний прибуток кожного масиву за тиждень;
2) загальний прибуток усіх магазинів по дням (загальний прибуток усіх магазинів за понеділок, за вівторок, і т.д.);
3) загальний прибуток за робочі дні
4) загальний прибуток за вихідні дні
5) максимальний прибуток за середу
6) сформувати загальний список (одновимірний масив) зі значенням, які що більші за 200
7) відсортувати кожен тиждень за зростанням
8) відсортувати тижні (рядки) за спаданням максимального елементи у цьому тижні (рядку), тобто при порівнянні рядків потрібно порівнювати максимальні елементи у кожному з цих рядків
9) упорядкувати тижні (рядки) за спаданням суми елементів у рядку (тобто при порівнянні двох рядків треба знайти суму кожного з рядків і порівнювати ці суми, на основі цих сум буде зрозуміло, який з елементів повинен іти раніше).

Задача 3. Морський бій. Випадковим чином на двовимірному полі розміром 6*6 розташовується 5 кораблів. Користувач стріляє вказуючи координати. Гра продовжується поки не потоплено усі кораблі або у користувача не закінчаться снаряди.
 */
const min = 1
const max = 100
function randomNum(minV, maxV) {
    return Math.floor(Math.random() * (maxV - minV + 1)) + minV
}

function multiArray(rows, columns, minV, maxV) {
    const arr = []
    for (let i = 0; i < rows; i++) {
        const row = []
        for (let j = 0; j < columns; j++) {
            const numRand = randomNum(minV, maxV)
            row.push(numRand)
        }
        arr.push(row)
    }
    return arr
}
const startArray = multiArray(4, 4, min, max)
console.log(startArray)
console.log("-------")
const arrTask1 = JSON.parse(JSON.stringify(startArray))
console.log(arrTask1)
// Задача 1. Знайти суми елементів у вказаній області
// 1) перша четверть: 1/4
console.log("перша четверть: 1/4")
let sum1 = 0
for (let i = 0; i < arrTask1.length / 2; i++) {
    for (let j = 0; j < arrTask1[i].length / 2; j++) {
        console.log(arrTask1[i][j])
        sum1 += arrTask1[i][j]
    }
}
console.log("Сума")
console.log(sum1)

// 2) друга четверть: 2/4
console.log("2) друга четверть: 2/4")
let sum2 = 0
for (let i = 0; i < arrTask1.length / 2; i++) {
    for (let j = arrTask1[i].length / 2; j < arrTask1[i].length; j++) {
        console.log(arrTask1[i][j])
        sum2 += arrTask1[i][j]
    }
}
console.log("Сума")
console.log(sum2)
// 3) третя чверть: 3/4
console.log("3) третя чверть: 3/4")
let sum3 = 0
for (let i = arrTask1.length / 2; i < arrTask1.length; i++) {}
