/*
Задача 1. Створити об’єкт «Тир». У масиві зберігаються 1, якщо у цьому квадраті є заєць і 0 в іншому випадку.
Тир	


Поля(властивості)
Масив, у якому зберігається поле з зайцями
Методи (дії)
Метод пострілу (задається позиція пострілу)
Виведення ігрового поля


Задача 2. Створити об’єкт «Авто». 
Авто	


Поля(властивості)
Марка
Розмір бака
Кількість наявних літрів
Кількість місць
Кількість пасажирів
Методи (дії)
Заправка на вказану кількість літрів
Виведення кількості пасажирів
Додавання пасажирів
Висадка пасажирів


Задача 3. Розробити клас MultChecker для перевірки таблиці множення
Поля
Число, яке перевіряємо (наприклад, перевірка частини таблиці множення на 7)
Кількість правильних відповідей
Кількість неправильних відповідей
Методи
Генерування прикладу (метод випадковим чином визначає друге число, перше число фіксоване)
Перевірка правильності вказаної відповіді
render - виведення інформації про тестування на екран




Задача 4. Розробити клас Baner
Поля
Масив об’єктів ( графічних зображень та посилань на сайти)


методи
Метод випадкового вибору об’єкта (графічного зображення та посилання)
Метод виведення випадкового банера




Задача 5. Розробити клас «Керівник танців»
Поля
Масив імен хлопців
Масив імен дівчат
Методи
Метод випадкового вибору імені хлопця
Метод випадкового вибору імені дівчини
Метод виведення пари для танців
Метод run , який ініціює через кожні 5 секунд виведення нової пари для танців

 */
/*  Задача 0. Дано два об’єкта. Обидва містять масив цілих чисел. При цьому у одному з них є функція знаходження суми, а у іншому – функція для знаходження добутку тих, які знаходяться між заданими мінімальним і максимальних значенням.
Використати обидва методи стосовно обидвох об’єктів (використати call, apply) */
const obj1 = {
  arr1: [1, 23, 24, 98],
  sumNumber: function () {
    return this.arr1.reduce((acc, el) => acc + el, 0)
  },
}
const obj2 = {
  arr1: [435, 32, 23, 23],
  prodNum: function () {
    return this.arr1.reduce((acc, el) => (el > 20 && el < 30 ? acc * el : acc), 1)
  },
}
const sum = obj1.sumNumber()
console.log(sum)
const prod = obj2.prodNum()
console.log(prod)
