"use strict"

//1. Дано ширину екрана та кількість елементів, які повинні бути відображені у рядку. Визначити ширину елементів, які повинні бути відображені у цьому рядку.

const widthMonitor = 1920
const countElem = 500

const widthElem = widthMonitor / countElem
console.log("--- ширина елементів")
console.log(Math.round(widthElem * 100) / 100)

//З клавіатури вводиться розмір заробітної плати та розмір прожиткового мінімуму. Визначити розмір соціальної допомоги (ввжаємо, що заробітна плата є меншою).
